// Задача 1. Напишите программу, которая на вход принимает два числа и выдаёт, 
// какое число большее, а какое меньшее.
// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3

// // Console.Clear();

// Console.Write("Введите А: ");
// int number1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите В: ");
// int number2 = Convert.ToInt32(Console.ReadLine());

// if (number1 > number2)
// {
    //  Console.WriteLine("A больше B");
// }
// else if (number1 < number2)
// {
   // Console.WriteLine("B больше A");
// }
// else
// { 
   // Console.WriteLine("A равно B");
//}



// Задача 2. Напишите программу, которая принимает 
// на вход три числа и выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

// Console.Clear();
// Console.Write("Введите число A: ");
// int number1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите число B: ");
// int number2 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите число C: ");
//int number3 = Convert.ToInt32(Console.ReadLine());
//
// int max = number1;
// if (max < number2);
//     max = number2;
// if (max < number3);
//     max = number3;
// 
// Console.WriteLine($"максимальное число = {max}");



// Задача 3. Напишите программу, которая на вход принимает число и выдаёт, 
// является ли число чётным (делится ли оно на два без остатка).
// 4 -> да
// -3 -> нет
// 7 -> нет

// Console.Clear();
// Console.Write("Введите число: ");
// int number = Convert.ToInt32(Console.ReadLine());
//
// if(number%2 == 0)
// {
//     Console.WriteLine("Число четное");
// }
// else
// {
//     Console.WriteLine("Число нечетное");
// }


// Задача 4: Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

// Console.Clear();
// Console.Write("Введите N: ");
// int N = Convert.ToInt32(Console.ReadLine());
// 
// int i = 2;
// while (i <= N)
// {
//     Console.Write($"{i}");
//     i += 2;
// }
